Repository: tuwaiq-tabuk-ios/Final_iOS_Bootcamp_Project-Wared-Ahlam
Catalog:   Wared - Ahlam Abdullah - Final  ٢ ٢/Wared - Ahlam Abdullah - Final/Support/*.lproj/Localizable.strings
Languages: ar

source: Our records indicate that you haven't donated yet. Do Good!
ar: تشیر سجلاتنا إلى أنك لم تتبرع بعد. أفعل خیر!

source: Please fill in all fields.
ar: جميع الخانات مطلوبة

source: Please make sure your password is at least 8 characters, contains a special character and a number.
ar: كلمة المرور يجب ان تكون اكثر من ٨ خانات ويجب ان تحتوي علي حرف كبير وارقام و[$@$#!%*?&]

source: Error!
ar: خطأ

source: Most Donates
ar: الأكثر تبرعاً

source: Invalid Age
ar: العمر غیر صالح

source: You must be over 18 old
ar: یجب أن یكون عمرك أكثر من ١٨ عاما

source: Riyadh
ar: الرياض

source: Mecca
ar: مكة

source: Medina
ar: المدينة المنورة

source: Tabuk
ar: تبوك

source: Abha
ar: ابها

source: Hail
ar: حائل

source: Jeddah
ar: جدة

source: Jizan
ar: جيزان

source: Khobar
ar: الخبر

source: Sakakah
ar: سكاكة

source: Dammam
ar: الدمام

source: Buraydah
ar: بريدة

source: Dhahran
ar: عنيزه

source: Select City
ar: اختر المدينة

source: Reservation
ar: الموعد

source: These questions help you a lot in determining the ability to donate blood, and reduce your time and effort, and we will only take 30 seconds!
ar: تساعدك هذه الأسئلة كثيرًا في تحديد القدرة على التبرع بالدم ، وتقليل وقتك وجهدك ، وسنأخذ 30 ثانية فقط! اذا كنت مؤهل للتبرع بالدم ؟

source: Done
ar: تم

source: cancel
ar: الغاء

source: error in getting Time
ar: خطأ في جلب الوقت

source: error in getting Date
ar: خطأ في جلب التاريخ

source: error in getting your Data
ar: خطأ في جلب البيانات

source: Reservation done Successfully
ar: تم حجز الموعد بنجاح

source: success!
ar: تم

source: You cann't Donnate now try in a nother time.
ar: عفوا لا يمكنك التبرع في الوقت الحالي .

source: Do you have a fever or a symptom of a respiratory illness or have you taken an antibiotic in the previous 10 days?
ar: ھل تعانین من الحمى أو من أعراض أمراض الجھاز التنفسي أو تناولت مضا ًدا حیویًا في الأیام العشرة الماضیة؟

source: Have you taken aspirin within the previous 48 hours?
ar: ھل تناولت الأسبرین خلال الـ ٤٨ ساعة الماضیة؟

source: Have you donated blood in the past 60 days?
ar: ھل تبرعت بالدم خلال الـ ٦٠ یو ًما الماضیة؟

source: Has surgery been performed within the previous 12 months?
ar: ھل أجریت الجراحة خلال الأشھر الـ ١٢ الماضیة؟

source: In the previous 12 months, have you been accidentally pricked with a needle, using cosmetic needles, or had cupping, tattooing or ear piercing?
ar: خلال الاثني عشر شھ ًرا الماضیة ، ھل تم وخزك بإبرة عن طریق الخطأ ، أو باستخدام إبر تجمیلیة ، أو خضعت للحجامة أو الوشم أو ثقب الأذن؟

source: Have you traveled outside the Kingdom in the previous 28 days?
ar: ھل سافرت خارج المملكة في الـ ٢٨ یو ًما الماضیة؟

source: Were you infected with the Corona virus during the past month, or suspected of infection, or close to an infected person?
ar: ھل أصبت بفیروس كورونا خلال الشھر الماضي ، أو اشتبھت في إصابتك ، أو بالقرب من شخص مصاب؟

source: Sign Up
ar: انشاء حساب

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: passowrd
ar: كلمة المرور

source: Book Appointment
ar: حجز موعد

source: Donations
ar: التبرع

source: Main
ar: الرئيسية

source: X69-bm-xSf.text
ar: البريد الإلكتروني

source: 1Nm-hx-zZN.text
ar: فئة الدم

source: fTb-bH-gn7.text
ar: عدد مرات التبرع

source: Donates
ar: التبرعات

source: Select Hospital
ar: اختر المستشفى

source: XXG-OK-5Mm.setTitle
ar: ابدأالفحص

source: King khaled Hospital
ar: مستشفي الملك خالد

source: Sunday-Thursday
ar: من الأحد للخميس

source: King Salman Hospital
ar: مستشفى الملك سلمان

source: King Fahd Bin Sultan Hospital
ar: مستشفى الملك فهد

source: Maternity and children hospital
ar: مستشفى الولادة والأطفال

source: Yes
ar: نعم

source: No
ar: لا

source: Emile
ar: الايميل

source: Donated
ar: عدد التبرعات

source: blood type
ar: فصيلة الدم

source: Name
ar: الاسم

source: personal date
ar: البيانات الشخصية

source: Logoff
ar: تسجيل خروج

source: Sorry there is already Appoinment
ar: عذرا يوجد بالفعل موعد

source: Close
ar: اغلاق

source: you Should enter a Valid Email
ar: يجب عليك إدخال بريد إلكتروني صالح

source: error in getting user Data :
ar: خطأ في الحصول على بيانات المستخدم

source: Hospital must be selected
ar: يجب اختيار المستشفى

source: Error
ar: خطا

source: Sorry!
ar: اسف!

source: Retype the password
ar: اعد كتابة كلمة المرور

source: The password is different
ar: كلمة المرور مختلفه

source: You have to choose the weight
ar: يجب اختيار وزنك

source: Yas
ar: نعم

source: Are you sure about canceling the appointment?
ar: هل أنت متأكد من إلغاء الموعد؟

source: Cancel
ar: الغاء

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: firstName
ar: الاسم الاول

source: lastName
ar: الاسم الاخير

source: bloodType
ar: نوع الدم

source: cityName
ar: المدينه

source: donated
ar: التبرع

source: Number of registered donations:
ar: عدد التبرعات المسجلة:

source: blood type:
ar: نوع الدم
